wso2/iskm-mcm/scripts/roles/getAllRoles.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ser="http://service.ws.um.carbon.wso2.org" xmlns:xsd="http://dao.service.ws.um.carbon.wso2.org/xsd">
   <soap:Header/>
   <soap:Body>
      <ser:getRoleNames/>
   </soap:Body>
</soap:Envelope>